Repository: lollipopkit/flutter_gpt_box
Catalog: lib/l10n/app_*.arb
Languages: fr, nl

# autoCheckUpdate
source: Auto check for updates
fr: Vérifier automatiquement les mises à jour
nl: Automatisch controleren op updates

# autoRmDupChat
source: Auto remove duplicate chats
fr: Supprimer automatiquement les chats en double
nl: Automatisch dubbele chats verwijderen

# autoScrollBottom
source: Auto scroll to bottom
fr: Défilement automatique vers le bas
nl: Automatisch naar beneden scrollen

# backupTip
source: Please keep backup files private and safe!
fr: Assurez-vous que votre fichier de sauvegarde est privé et sécurisé !
nl: Zorg ervoor dat uw back-upbestand privé en veilig is!

# calcTokenLen
source: Calculate tokens length
fr: Calculer la longueur des tokens
nl: Tokenlengte berekenen

# changeModelTip
source: Different keys may be able to access different lists of models, so if you don't understand the mechanism and get an error, it is recommended to reset the model.
fr: Différentes clés peuvent accéder à différentes listes de modèles. Si vous ne comprenez pas le mécanisme et que des erreurs surviennent, il est recommandé de reconfigurer le modèle.
nl: Verschillende sleutels kunnen toegang hebben tot verschillende modellijsten. Als u het mechanisme niet begrijpt en er fouten optreden, is het raadzaam om het model opnieuw in te stellen.

source: Chat history length
fr: Longueur de l'historique du chat
nl: Lengte chatgeschiedenis

# chatHistoryTip
source: Use as chat context
fr: Utilisé comme contexte du chat
nl: Gebruikt als chatcontext

source: Click to check
fr: Cliquer pour vérifier
nl: Klik om te controleren

source: Clipboard
fr: Presse-papiers
nl: Klembord

source: Code block
fr: Bloc de code
nl: Codeblok

# colorSeedTip
source: It's color seed, not color
fr: Ceci est une graine de couleur, pas une couleur
nl: Dit is een kleurzaad, geen kleur

source: Compress
fr: Compresser
nl: Comprimeren

# compressImgTip
source: For chat and share
fr: Pour le chat et le partage
nl: Voor chatten en delen

# contributor
source: Contributors
fr: Contributeur
nl: Bijdrager

source: Copied
fr: Copié
nl: Gekopieerd

source: Current
fr: Actuel
nl: Huidig

source: Custom
fr: Personnalisé
nl: Aangepast

source: day
fr: jour
nl: dag

source: Default
fr: Par défaut
nl: Standaard

# delFmt
source: Delete {type}({id})?
fr: Supprimer {type} ({id}) ?
nl: {type} ({id}) verwijderen?

source: Delete
fr: Supprimer
nl: Verwijderen

# deleteConfirm
source: Confirmation berfore delete
fr: Confirmer avant de supprimer
nl: Bevestigen voor verwijderen

source: Editor
fr: Éditeur

# emptyFields
source: {fields} is empty
fr: {fields} sont vides
nl: {fields} zijn leeg

# fileNotFound
source: File({file}) not found
fr: Fichier ({file}) non trouvé
nl: Bestand ({file}) niet gevonden

# fileTooLarge
source: File too large: {size}
fr: Fichier trop volumineux : {size}
nl: Bestand te groot: {size}

source: Follow chat model
fr: Suivre le modèle de chat
nl: Chatmodel volgen

source: Font size
fr: Taille de police
nl: Lettergrootte

# fontSizeSettingTip
source: Applies only to code blocks
fr: S'applique uniquement aux blocs de code
nl: Alleen van toepassing op codeblokken

source: Free copy
fr: Copie libre
nl: Vrij kopiëren

# genChatTitle
source: Chat title generator
fr: Générer un titre de chat
nl: Chattitel genereren

source: Help
fr: Aide

source: History
fr: Historique
nl: Geschiedenis

source: hour
fr: heure
nl: uur

# ignoreTip
source: Ignore tips
fr: Ignorer l'astuce
nl: Tip negeren

# initChatHelp
source: ### 📖 Tip - Overscroll on the chat page to switch chat history. - Long press non-code block to free copy raw markdown data / delete / etc., long press code block to free copy code. - URL Scheme usage can be found [here]({unilink}) ### 🔍 Help - If you have found a bug, please use [Github Issue]({issue})
fr: ### 📖 Astuces - Le défilement excessif (overscroll) dans l'interface de chat permet de basculer rapidement entre les historiques de chat - Appuyez longuement sur le texte du chat pour sélectionner et copier librement la source Markdown - L'utilisation du schéma URL peut être trouvée [ici]({unilink}) ### 🔍 Aide - Si GPT Box a des bugs, utilisez [Github Issue]({issue}) - Telegram `@lpktg`
nl: ### 📖 Tips - Overmatig scrollen (overscroll) in het chatscherm laat je snel schakelen tussen chatgeschiedenissen - Lang drukken op chattekst laat je vrij Markdown-bron selecteren en kopiëren - URL-schema gebruik kan [hier]({unilink}) worden gevonden ### 🔍 Help - Als GPT Box bugs heeft, gebruik [Github Issue]({issue}) - Telegram `@lpktg`

# invalidLinkFmt
source: Invalid link: {uri}
fr: Lien inconnu : {uri}
nl: Onbekende link: {uri}

# joinBeta
source: Join Beta Program
fr: Rejoindre le test bêta
nl: Deelnemen aan bètatest

source: License
fr: Licence
nl: Licentie

# licenseMenuItem
source: Open-source licenses
fr: Licences open source
nl: Open-source licenties

source: Manual
fr: Manuel
nl: Handmatig

# minute
source: min
fr: minute
nl: minuut

source: Model
fr: Modèle

source: More
fr: Plus
nl: Meer

source: Multimodel
fr: Multimodal
nl: Multimodaal

source: My other apps
fr: Mes autres applications
nl: Mijn andere apps

# needOpenAIKey
source: Please input OpenAI Key first.
fr: Veuillez d'abord saisir la clé OpenAI
nl: Voer eerst de OpenAI-sleutel in

# needRestart
source: Need restart to take effect
fr: Redémarrage nécessaire pour appliquer
nl: Herstart nodig om toe te passen

source: New chat
fr: Nouveau chat
nl: Nieuwe chat

source: No duplication
fr: Pas de doublon
nl: Geen duplicaten

# notSupported
source: {val} is not supported
fr: {val} n'est pas pris en charge
nl: {val} wordt niet ondersteund

# onlyRestoreHistory
source: Only restore histories (exclude api url / secret key)
fr: Restaurer uniquement l'historique des chats (ne pas restaurer l'URL de l'API et la clé secrète)
nl: Alleen chatgeschiedenis herstellen (API-URL en geheime sleutel niet herstellen)

source: Only sync on launch
fr: Synchroniser uniquement au lancement
nl: Alleen synchroniseren bij opstarten

source: Other
fr: Autre
nl: Overig

# passwd
source: Password
fr: Mot de passe
nl: Wachtwoord

source: Privacy
fr: Confidentialité

# privacyTip
source: This app does not collect any data.
fr: Cette application ne collecte aucune information.
nl: Deze app verzamelt geen informatie.

source: Profile
fr: Profil
nl: Profiel

# promptsSettingsItem
source: Prompts
fr: Invites

source: Raw
fr: Brut
nl: Onbewerkt

source: Refresh
fr: Actualiser
nl: Vernieuwen

source: Rename
fr: Renommer
nl: Hernoemen

source: Replay
fr: Rejouer
nl: Herhalen

# res
source: Resource
fr: Ressource
nl: Bron

# restoreOpenaiTip
source: Document can be found [here]({url})
fr: La documentation peut être trouvée [ici]({url})
nl: Documentatie kan [hier]({url}) worden gevonden

# rmDuplication
source: Remove duplication
fr: Supprimer les doublons
nl: Duplicaten verwijderen

# rmDuplicationFmt
source: Sure to delete [{count}] items?
fr: Êtes-vous sûr de vouloir supprimer [{count}] éléments en double ?
nl: Weet u zeker dat u [{count}] dubbele items wilt verwijderen?

source: Save
fr: Enregistrer
nl: Opslaan

# saveErrChat
source: Save chat with errors
fr: Enregistrer le chat avec erreur
nl: Foutieve chat opslaan

# saveErrChatTip
source: Save the chat after each message sent or received even if it has error.
fr: Enregistrer après réception/envoi de chaque message, même s'il y a des erreurs
nl: Opslaan na ontvangen/verzenden van elk bericht, zelfs als er fouten zijn

# scrollSwitchChat
source: Scroll to switch chat
fr: Faire défiler pour changer de chat
nl: Scrollen om van chat te wisselen

source: Search
fr: Rechercher
nl: Zoeken

source: Secret key
fr: Clé secrète
nl: Geheime sleutel

source: Share
fr: Partager
nl: Delen

source: Share from
fr: Partagé depuis
nl: Gedeeld van

# skipSameTitle
source: Skip chats with titles that are the same as local chats.
fr: Ignorer les chats avec le même titre que les chats locaux
nl: Chats met dezelfde titel als lokale chats overslaan

source: Soft wrap
fr: Retour à la ligne automatique
nl: Zachte terugloop

source: stt
fr: Parole vers texte
nl: Spraak naar tekst

# sureRestoreFmt
source: Are you sure to restore Backup({time})?
fr: Êtes-vous sûr de vouloir restaurer la sauvegarde ({time}) ?
nl: Weet u zeker dat u de back-up ({time}) wilt herstellen?

# syncConflict
source: Sync conflict: can't turn on {a} and {b} at the same time.
fr: Conflit : impossible d'activer {a} et {b} en même temps
nl: Conflict: kan {a} en {b} niet tegelijkertijd activeren

source: System
fr: Système
nl: Systeem

source: Text
fr: Texte
nl: Tekst

source: Theme color seed
fr: Graine de couleur du thème
nl: Themakleurzaad

source: Theme mode
fr: Mode de thème
nl: Thema-modus

source: Third Party
fr: Tiers
nl: Derde partij

source: Tool
fr: Outil

# toolFinishTip
source: Tools invocation completed.
fr: Appel d'outil terminé
nl: Toolaanroep voltooid

source: TTS
fr: Texte vers parole
nl: Tekst naar spraak

source: Untitled
fr: Sans titre
nl: Naamloos

source: Update
fr: Mettre à jour
nl: Bijwerken

source: Usage
fr: Utilisation
nl: Gebruik

source: User
fr: Utilisateur
nl: Gebruiker

# weeksAgo
source: {weeks} weeks ago
fr: Il y a {weeks} semaines
nl: {weeks} weken geleden

source: Wrap
fr: Envelopper
nl: Omslaan

source: Assistant
nl: Assistent

source: Attention
nl: Opgelet

source: Image
nl: Afbeelding

source: Message
nl: Bericht

source: Participant
nl: Deelnemer
